# DAY 02 ADF Class 02

# Different Source files/ File formats

# CSV

In [ ]:
# csv
# Inventory,promotions

# Reading

# Full Loading: here Entire data will be loaded into the memory

# read_csv : pandas
# csv library: import csv with opencv
# np.getfromtext("data.csv",delimiter=',')

# Lazy Loading/Execution: during computation, Data will be loaded into the memory

# pl.read_csv : polars

# tsv

In [ ]:
# tsv

# read_csv(data.csv,sep='\t') : pandas
# csv library: import csv with opencv
# np.getfromtext("data.csv",delimiter='\t')


# pl.read_csv : polars

# json

In [ ]:
# json
# Real-time logging, Sensors data, IOT devices

# API Response: Json format

# import json : package
# pd.read_json : Pandas
# json_normalize(): Nested structures
# ujson: package: fast : C based implementation
# rapidjson
# dataschemas : marshmallow

In [ ]:
### unstructured

# pdf : In finances, Invoices will be in pdf formats

# Read the pdf and exract the text

# pypdf2 library
# pdfminer library
# tika


# docx

# docx library


# images

# tesseract 

# audiofiles

# pyaudio
# GTTS

# Big data formats

In [25]:
data = [
    {"id": 1, "name": "ML LABS"},
    {"id": 2, "name": "Abhishek Shetty"},
    {"id": 3, "name": "Awaiz Khan Pathan"},
    {"id": 4, "name": "Chaitanya Kengar"},
    {"id": 5, "name": "Dilli Babu N"},
    {"id": 6, "name": "Dinesh Kumar"},
    {"id": 7, "name": "Haritha Reddy"},
    {"id": 8, "name": "K Jhansi"},
    {"id": 9, "name": "Laki Mohanty"},
]

In [29]:
import pandas as pd
df=pd.DataFrame(data)
df

   id               name
0   1            ML LABS
1   2    Abhishek Shetty
2   3  Awaiz Khan Pathan
3   4   Chaitanya Kengar
4   5       Dilli Babu N
5   6       Dinesh Kumar
6   7      Haritha Reddy
7   8           K Jhansi
8   9       Laki Mohanty

Converting into CSV

In [33]:
df.to_csv("sample.csv")

Converting into JSON

In [39]:
import json
with open("Student data.json","w") as f:
    json.dump(data,f)

# Parquet Format
Use case: bronze and silver layer whenever data not using for any visualization, analysis.

In [ ]:
# Columanar 
# compression alg: snappy

In [45]:
import numpy as np
import pandas as pd
import sys

In [83]:
data={
    "id":range(10000),
    "name": ["name" + str(i) for i in range(1,10001)],
    "age": np.random.randint(10,50,size=10000),
    "city": np.random.choice(["Bangalore","Chennai","Hyderabad","New delhi","Mumbai"],size=10000)
}

In [85]:
df=pd.DataFrame(data)
df

        id       name  age       city
0        0      name1   47  Bangalore
1        1      name2   26  Bangalore
2        2      name3   28    Chennai
3        3      name4   31  New delhi
4        4      name5   28     Mumbai
...    ...        ...  ...        ...
9995  9995   name9996   33  Hyderabad
9996  9996   name9997   18     Mumbai
9997  9997   name9998   38    Chennai
9998  9998   name9999   31     Mumbai
9999  9999  name10000   18    Chennai

[10000 rows x 4 columns]

In [87]:
df.to_csv("Data_p.csv")

In [95]:
import os
csv_size=os.path.getsize("Data_p.csv")/(1024**2)
print(csv_size)

0.3019428253173828

In [71]:
# Memory Management: we need to measure data by its physical location i.e file size

# (df.memory_usage(deep=True).sum())/(1024*1024)

np.float64(1.200937271118164)

In [75]:
# Converting into Parquet format

df.to_parquet("Parquet_file",engine="pyarrow")      # 2 Engines: pyarrow and fastparquet

In [79]:
df_parquet=pd.read_parquet("Parquet_file")
df_parquet

        id       name  age       city
0        0      name1   10  Bangalore
1        1      name2   41  New delhi
2        2      name3   19    Chennai
3        3      name4   42    Chennai
4        4      name5   10    Chennai
...    ...        ...  ...        ...
9995  9995   name9996   37  Bangalore
9996  9996   name9997   28     Mumbai
9997  9997   name9998   24  Hyderabad
9998  9998   name9999   26  Bangalore
9999  9999  name10000   37  New delhi

[10000 rows x 4 columns]

In [97]:
import os
parquet_size=os.path.getsize("Parquet_file")/(1024**2)
print(parquet_size)

0.12803173065185547

# Avro

In [ ]:
# Use case: real-time streaming data: Kafka
# it store schema
# records all the data in brinary format
# A sequence of records (row by row) 
# compression alg: binary

In [112]:
pip install fastavro

Collecting fastavroNote: you may need to restart the kernel to use updated packages.

  Downloading fastavro-1.12.0-cp312-cp312-win_amd64.whl.metadata (5.9 kB)
Downloading fastavro-1.12.0-cp312-cp312-win_amd64.whl (445 kB)
Installing collected packages: fastavro
Successfully installed fastavro-1.12.0

In [114]:
from fastavro import writer,reader,parse_schema

In [119]:
# Schema: Columns and its datatype

schema = {                                            
"type": "record",
"name": "Student",
"fields": [
{"name": "id", "type": "int"},
{"name": "name", "type": "string"},
{"name": "class", "type": "string"},
{"name": "marks", "type": "int"}
    ]
}

In [123]:
parsed_schema=parse_schema(schema)
parsed_schema

{'type': 'record',
 'name': 'Student',
 'fields': [{'name': 'id', 'type': 'int'},
  {'name': 'name', 'type': 'string'},
  {'name': 'class', 'type': 'string'},
  {'name': 'marks', 'type': 'int'}],
 '__fastavro_parsed': True,
 '__named_schemas': {'Student': {'type': 'record',
   'name': 'Student',
   'fields': [{'name': 'id', 'type': 'int'},
    {'name': 'name', 'type': 'string'},
    {'name': 'class', 'type': 'string'},
    {'name': 'marks', 'type': 'int'}]}}}

In [141]:
students = [
{"id": 1, "name": "Alice", "class": "10A", "marks": 88},
{"id": 2, "name": "Bob", "class": "10B", "marks": 75},
{"id": 3, "name": "Carol", "class": "10A", "marks": 92},
{"id": 4, "name": "Dave", "class": "10C", "marks": 67},
{"id": 5, "name": "Eve", "class": "10B", "marks": 80}]


print("BEFORE (Raw Python Objects):")
for s in students:
    print(s)

# Step 3: Write data to Avro file
file_path = "students.avro"
with open(file_path, "wb") as out:    # wb: writebinary
    writer(out, parsed_schema, students)

BEFORE (Raw Python Objects):
{'id': 1, 'name': 'Alice', 'class': '10A', 'marks': 88}
{'id': 2, 'name': 'Bob', 'class': '10B', 'marks': 75}
{'id': 3, 'name': 'Carol', 'class': '10A', 'marks': 92}
{'id': 4, 'name': 'Dave', 'class': '10C', 'marks': 67}
{'id': 5, 'name': 'Eve', 'class': '10B', 'marks': 80}

In [173]:
import os
Filesize= os.path.getsize(file_path)
Filesize
print(f"Data written to {file_path} (binary Avro format). {Filesize} Bytes")

# Stap 4: Read back from Aro file
print("AFTER (Read Back from Avro):")
with open(file_path, "rb") as fo:          # rb: read binary
    for record in reader(fo):
        print(record)

Data written to students.avro (binary Avro format). 317 Bytes
AFTER (Read Back from Avro):
{'id': 1, 'name': 'Alice', 'class': '10A', 'marks': 88}
{'id': 2, 'name': 'Bob', 'class': '10B', 'marks': 75}
{'id': 3, 'name': 'Carol', 'class': '10A', 'marks': 92}
{'id': 4, 'name': 'Dave', 'class': '10C', 'marks': 67}
{'id': 5, 'name': 'Eve', 'class': '10B', 'marks': 80}

# Orc (optimzed row columnar)

In [ ]:
# orc
# hortonworks for hadoop & hive

# columnar storage+optimized
# only reads by column
# uses lightweight compression zlib
# indexs : stores row level min, max , counts
# it supports ACID transactions
# large orc file can be split into stripes for parallelism

# APIs

In [ ]:
# ADF: web acitivity

In [182]:
import requests

api_address='https://api.openweathermap.org/data/3.0/onecall?lat={lat}&lon={lon}&exclude={part}&appid={220aa2be0c8c019b3b1f152e78ccb7d5}'
city_input=input()
url=api_address+city_input
requests.get(url) .json()

 bangalore

{'cod': 401,
 'message': 'Please note that using One Call 3.0 requires a separate subscription to the One Call by Call plan. Learn more here https://openweathermap.org/price. If you have a valid subscription to the One Call by Call plan, but still receive this error, then please see https://openweathermap.org/faq#error401 for more info.'}